Repository: Haenes/telegram-bot
Catalog: locale/*/LC_MESSAGES/bot.po
Languages: ru

source: True
ru: Да

source: False
ru: Нет

source: Moscow
ru: Москва

source: Vladivostok
ru: Владивосток

source: Bug
ru: Баг

source: Feature
ru: Фича

source: Lowest
ru: Низший

source: Low
ru: Низкий

source: Medium
ru: Средний

source: High
ru: Высокий

source: Highest
ru: Высочайший

source: To do
ru: Сделать

source: In progress
ru: В процессе

source: Done
ru: Сделано

source: The project was successfully deleted!
ru: Проект успешно удалена!

source: The issue was successfully deleted!
ru: Задача успешно удалёна!

source: Action canceled.
ru: Действие отменено.

source: A quick guide to working with me: 1) Login: first step is log in via /login command. Without it, I won't work! 2) Main menu accessed via /menu command. Here you can choose what to work with: projects or issues. 3) After your choice, you will be able to create a new element (project or issue, depending on what you have chosen) and view information about it. 4) After the next selection, you can change the data of the element or delete it altogether! <b>Please note that you must already be registered through the website. If you don't have an account yet, then you need to create one and only then use me </b>
ru: Быстрая инструкция по работе со мной: 1) Вход: сначала нужно войти используя команду /login. Без этого, я не стану работать! 2) Главное менюю доступно по команде /menu. Здесь вы выбираете с чем работать: проектами или задачами. 3) После вашего выбора, вы сможете создать новый элемент (проект или задачу, в зависимости от того, что вы выбрали) и просмотреть информацию о нём. 4) После следующего выбора, вы сможете изменить данные элемента или вовсе его удалить! <b>Пожалуйста, обратите внимание, что вы должны быть заранее зарегестрированы на сайте. Если у вас ещё нет аккаунта, то вам нужно его создать и только тогда использовать меня </b>

source: Hello, {user}! {text}
ru: Привет, {user}! {text}

source: You're already logged in, use the /menu command.
ru: Вы уже вошли, используйте команду /menu.

source: Please, enter your <u>username and password</u> after /login command! Example: /login USERNAME PASSWORD
ru: Пожалуйста, введите ваш <u>логин и пароль </u> после команды /login! Например: /login ЛОГИН ПАРОЛЬ

source: Successful login! To continue, enter /menu command.
ru: Успешный вход! Чтобы продолжить, введите команду /menu.

source: Invalid username/password!
ru: Неверный логин/пароль!

source: From here, u can see all of yours <b>Projects</b> and <b>Issues</b>.
ru: Отсюда, вы можете просмотреть все ваши <b>Проекты</b> и <b>Задачи</b>

source: Choose what you want to change:
ru: Выберите, что хотите изменить:

source: Select a language:
ru: Выберите язык:

source: You have changed the language!
ru: Вы изменили язык!

source: Select the time zone:
ru: Выберите часовой пояс:

source: You have changed the timezone!
ru: Вы изменили часовой пояс!

source: Now you will need to enter the data one by one to create a new issue. <u>Note</u>: you can cancel the creation process by entering: /cancel. <b>Enter related to issue project:</b>
ru: Для создания новой задачи, сейчас вам нужно будет вводить данные по порядку. <u>Обратите внимание</u>: вы можете отменить процесс обновления, введя команду: /cancel <b>Введите название проекта, связанного с задачей:</b>

source: Project not found! Please, try again!
ru: Проект не найден! Пожалуйста, попробуйте снова!

source: Good, now <b>enter the issue title:</b>
ru: Отлично, теперь <b>введите название задачи:</b>

source: Invalid project name, please, try again!
ru: Неверное название проекта, пожалуйста, попробуйте снова!

source: Good, now <b>enter description:</b>
ru: Отлично, теперь <b>введите описание:</b>

source: Good, now <b>enter key:</b>
ru: Отлично, теперь <b>введите ключ:</b>

source: Good, now <b>select type:</b>
ru: Отлично, теперь <b>выберите тип:</b>

source: Good, now <b>select priority:</b>
ru: Отлично, теперь <b>выберите приоритет:</b>

source: Please select one of the options on the keyboard.
ru: Пожалуйста, выберите один из вариантов на клавиатуре.

source: Good, now <b>select status:</b>
ru: Отлично, теперь <b>выберите статус:</b>

source: The issue has been successfully created!
ru: Задача успешно создана!

source: An error occurred, the issue was NOT created! Try again
ru: Возникла ошибка, задача НЕ была создана! Попробуйте ещё раз

source: List of issues, page 1:
ru: Список задач, страница 1:

source: <b>Project</b>: {project} <b>Title</b>: {title} <b>Description</b>: {description} <b>Key</b>: {key} <b>Type</b>: {type} <b>Priority</b>: {priority} <b>Status</b>: {status} <b>Created</b>: {created} <b>Updated</b>: {updated}
ru: <b>Проект</b>: {project} <b>Название</b>: {title} <b>Описание</b>: {description} <b>Ключ</b>: {key} <b>Тип</b>: {type} <b>Приоритет</b>: {priority} <b>Статус</b>: {status} <b>Создана</b>: {created} <b>Обновлена</b>: {updated}

source: List of issues, page {page}:
ru: Cписок задач, страница {page}:

source: Now you will need to enter the data one by one to update issue. <u>Note</u>: you can cancel the update process by entering: /cancel. <b>Previous title: {title}</b> <b>New title:</b>
ru: Для обновления задачи, сейчас вам нужно будет вводить данные по порядку. <u>Обратите внимание</u>: вы можете отменить процесс обновления, введя команду: /cancel. <b>Предыдущее название: {title}</b> <b>Новое название:</b>

source: Good, now enter the issue description. <b>Previous description: {description}</b> <b>New description:</b>
ru: Отлично, теперь введите описание задачи. <b>Предыдущее описание: {description}</b> <b>Новое описание:</b>

source: Good, now enter the issue key. <b>Previous key: {key}</b> <b>New key:</b>
ru: Отлично, теперь введите ключ задачи. <b>Предыдущий ключ: {key}</b> <b>Новый ключ:</b>

source: Good, now select the issue type. <b>Previous type: {type}</b> <b>New type:</b>
ru: Отлично, теперь выберите тип задачи. <b>Предыдущий тип: {type}</b> <b>Новый тип:</b>

source: Good, now select the issue priority <b>Previous priority: {priority}</b> <b>New priority:</b>
ru: Отлично, теперь выберите приоритет задачи. <b>Предыдущий приоритет: {priority}</b> <b>Новый приоритет:</b>

source: Good, now select the issue status. <b>Previous status: {status}</b> <b>New status:</b>
ru: Отлично, теперь выберите статус задачи <b>Предыдущий статус: {status}</b> <b>Новый статус:</b>

source: The issue has been successfully updated!
ru: Задача успешна обновлёна!

source: An error occurred, the issue was NOT updated!
ru: Возникла ошибка, задача НЕ была обновлёна!

source: Now you will need to enter the data one by one to create a new project. <u>Note</u>: you can cancel the creation process by entering: /cancel. <b>Enter project name:</b>
ru: Для создания нового проекта, сейчас вам нужно будет вводить данные по порядку. <u>Обратите внимание</u>: вы можете отменить процесс обновления, введя команду: /cancel <b>Введите название проекта:</b>

source: Good, now <b>enter description of the project:</b>
ru: Отлично, теперь <b>введите описание проекта:</b>

source: Good, now <b>enter key of the project:</b>
ru: Отлично, теперь <b>введите ключ проекта:</b>

source: Good, now <b>select type of the project:</b>
ru: Отлично, теперь <b>выберите тип проекта:</b>

source: Good, now <b>select whether the project will be a favorite or not:</b>
ru: Отлично, теперь <b>выберите, будет ли проект избранным или нет:</b>

source: The project has been successfully created!
ru: Проект успешно создан!

source: An error occurred, the project was NOT created!
ru: Возникла ошибка, проект НЕ был создан!

source: List of projects, page {page}:
ru: Cписок проектов, страница {page}:

source: List of projects, <b>page 1</b>:
ru: Список проектов, <b>страница 1</b>:

source: <b>Name</b>: {name} <b>Description</b>: {description} <b>Key</b>: {key} <b>Type</b>: {type} <b>Favorite</b>: {starred} <b>Created</b>: {created}
ru: <b>Название</b>: {name} <b>Описание</b>: {description} <b>Ключ</b>: {key} <b>Тип</b>: {type} <b>Избранный</b>: {starred} <b>Создан</b>: {created}

source: Now you will need to enter the data one by one to update project. <u>Note</u>: you can cancel the update process by entering: /cancel. <b>Previous name: {name}</b> <b>New name:</b>
ru: Для обновления задачи, сейчас вам нужно будет вводить данные по порядку. <u>Обратите внимание</u>: вы можете отменить процесс обновления, введя команду: /cancel. <b>Предыдущее название: {name}</b> <b>Новое название:</b>

source: Good, now enter description of the project. <b>Previous description: {description}</b> <b>New description:</b>
ru: Отлично, теперь введите описание проекта. <b>Предыдущее описание: {description}</b> <b>Новое описание:</b>

source: Good, now enter key of the project. <b>Previous key: {key}</b> <b>New key:</b>
ru: Отлично, теперь введите ключ проекта. <b>Предыдущий ключ: {key}</b> <b>Новый ключ:</b>

source: Good, now choose type of the project. <b>Previous type: {type}</b> <b>New type:</b>
ru: Отлично, теперь выберите тип проекта. <b>Предыдущий тип: {type}</b> <b>Новый тип:</b>

source: Good, now choose whether the project will be a favorite or not. <b>Earlier: {starred}</b> <b>Now:</b>
ru: Отлично, теперь выберите, будет ли проект избранным или нет. <b>Ранее: {starred}</b> <b>Сейчас:</b>

source: The project has been successfully updated!
ru: Проект успешно обновлён!

source: An error occurred, the project was NOT updated!
ru: Возникла ошибка, проект НЕ был обновлён!

source: Create
ru: Создать

source: << Back
ru: << Назад

source: Next >>
ru: Вперёд >>

source: Change
ru: Изменить

source: Delete
ru: Удалить

source: Projects
ru: Проекты

source: Issues
ru: Задачи

source: Language
ru: Язык

source: Timezone
ru: Часовой пояс
